iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis-KL02/targetInit/MKL02Z32_sfr.h
};

#define FTFA (*(volatile struct FTFA_tag *) 0x40020000)

struct TPM0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:3;
      uint64_t CMOD:2;
      uint64_t CPWMS:1;
      uint64_t TOIE:1;
      uint64_t TOF:1;
      uint64_t DMA:1;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1V;

  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0F:1;
      uint64_t CH1F:1;
      uint64_t RESERVED_0:6;
      uint64_t TOF:1;
      uint64_t RESERVED_1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  uint8_t res1[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:5;
      uint64_t DOZEEN:1;
      uint64_t DBGMODE:2;
      uint64_t RESERVED_1:1;
      uint64_t GTBEEN:1;
      uint64_t RESERVED_2:6;
      uint64_t CSOT:1;
      uint64_t CSOO:1;
      uint64_t CROT:1;
      uint64_t RESERVED_3:5;
      uint64_t TRGSEL:4;
      uint64_t RESERVED_4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONF;

};

#define TPM0 (*(volatile struct TPM0_tag *) 0x40038000)

struct TPM1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:3;
      uint64_t CMOD:2;
      uint64_t CPWMS:1;
      uint64_t TOIE:1;
      uint64_t TOF:1;
      uint64_t DMA:1;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1V;

  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0F:1;
      uint64_t CH1F:1;
      uint64_t RESERVED_0:6;
      uint64_t TOF:1;
      uint64_t RESERVED_1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  uint8_t res1[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:5;
      uint64_t DOZEEN:1;
      uint64_t DBGMODE:2;
      uint64_t RESERVED_1:1;
      uint64_t GTBEEN:1;
      uint64_t RESERVED_2:6;
      uint64_t CSOT:1;
      uint64_t CSOO:1;
      uint64_t CROT:1;
      uint64_t RESERVED_3:5;
      uint64_t TRGSEL:4;
      uint64_t RESERVED_4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONF;

};

#define TPM1 (*(volatile struct TPM1_tag *) 0x40039000)

struct ADC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t RESERVED_0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t RESERVED_0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC1B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADICLK:2;
      uint64_t MODE:2;
      uint64_t ADLSMP:1;
      uint64_t ADIV:2;
      uint64_t ADLPC:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADLSTS:2;
      uint64_t ADHSC:1;
      uint64_t ADACKEN:1;
      uint64_t MUXSEL:1;
      uint64_t RESERVED_0:3;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFSEL:2;
      uint64_t DMAEN:1;
      uint64_t ACREN:1;
      uint64_t ACFGT:1;
      uint64_t ACFE:1;
      uint64_t ADTRG:1;
      uint64_t ADACT:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVGS:2;
      uint64_t AVGE:1;
      uint64_t ADCO:1;
      uint64_t RESERVED_0:2;
      uint64_t CALF:1;
      uint64_t CAL:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PG:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG;

