iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis-KL02/targetInit/MKL02Z32_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPD:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPS:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP4:10;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLP4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP3:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP2:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP1:7;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP0:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLP0;

};

#define ADC0 (*(volatile struct ADC0_tag *) 0x4003b000)

struct LPTMR0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TMS:1;
      uint64_t TFC:1;
      uint64_t TPP:1;
      uint64_t TPS:2;
      uint64_t TIE:1;
      uint64_t TCF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:2;
      uint64_t PBYP:1;
      uint64_t PRESCALE:4;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPARE:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNR;

};

#define LPTMR0 (*(volatile struct LPTMR0_tag *) 0x40040000)

struct SIM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:16;
      uint64_t RESERVED_1:8;
      uint64_t TPMSRC:2;
      uint64_t UART0SRC:2;
      uint64_t RESERVED_2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOPT2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:18;
      uint64_t TPM1CH0SRC:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:3;
      uint64_t TPM0CLKSEL:1;
      uint64_t TPM1CLKSEL:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOPT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART0TXSRC:1;
      uint64_t RESERVED_0:1;
      uint64_t UART0RXSRC:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:3;
      uint64_t RESERVED_3:9;
      uint64_t UART0ODE:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOPT5;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0TRGSEL:4;
      uint64_t ADC0PRETRGSEL:1;
      uint64_t RESERVED_0:2;
      uint64_t ADC0ALTTRGEN:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOPT7;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINID:4;
      uint64_t RESERVED:3;
      uint64_t DIEID:5;
      uint64_t REVID:4;
      uint64_t SRAMSIZE:4;
      uint64_t SERIESID:4;
      uint64_t SUBFAMID:4;
      uint64_t FAMID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDID;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t RESERVED_1:2;
      uint64_t I2C0_bitfield:1;
      uint64_t I2C1_bitfield:1;
      uint64_t RESERVED_2:2;
      uint64_t UART0_bitfield:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:4;
      uint64_t RESERVED_7:1;
      uint64_t CMP:1;
      uint64_t RESERVED_8:2;
      uint64_t SPI0_bitfield:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:5;
      uint64_t RESERVED_11:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCGC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPTMR:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:3;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:2;
      uint64_t PORTA_bitfield:1;
      uint64_t PORTB_bitfield:1;
      uint64_t RESERVED_5:3;
      uint64_t RESERVED_6:5;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCGC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTF:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:13;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:7;
      uint64_t RESERVED_4:1;
      uint64_t TPM0_bitfield:1;
      uint64_t TPM1_bitfield:1;
      uint64_t RESERVED_5:1;
      uint64_t ADC0_bitfield:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCGC6;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:16;
      uint64_t OUTDIV4:3;
      uint64_t RESERVED_1:9;
      uint64_t OUTDIV1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV1;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASHDIS:1;
      uint64_t FLASHDOZE:1;
      uint64_t RESERVED_0:22;
      uint64_t PFSIZE:4;
      uint64_t RESERVED_1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:16;
      uint64_t RESERVED_1:7;
      uint64_t RESERVED_2:1;
      uint64_t MAXADDR0:7;
      uint64_t RESERVED_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG2;

