iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis-KL02/targetInit/MKL02Z32_sfr.h
  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UIDMH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UIDML;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UIDL;

  uint8_t res7[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COPW:1;
      uint64_t COPCLKS:1; 
      uint64_t COPT:2; 
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COPC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRVCOP:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRVCOP;

};

#define SIM (*(volatile struct SIM_tag *) 0x40048004)

struct PORTA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t RESERVED_1:1;
      uint64_t DSE:1;
      uint64_t RESERVED_2:1;
      uint64_t MUX:3;
      uint64_t RESERVED_3:5;
      uint64_t IRQC:4;
      uint64_t RESERVED_4:4;
      uint64_t ISF:1;
      uint64_t RESERVED_5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPCHR;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISFR;

