iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis-KL02/targetInit/MKL02Z32_sfr.h
};

#define PORTB (*(volatile struct PORTB_tag *) 0x4004a000)

struct MCG_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t IREFSTEN:1;
      uint64_t IRCLKEN:1;
      uint64_t IREFS:1;
      uint64_t FRDIV:3;
      uint64_t CLKS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IRCS:1;
      uint64_t LP:1;
      uint64_t EREFS0:1;
      uint64_t HGO0:1;
      uint64_t RANGE0:2;
      uint64_t FCFTRIM:1;
      uint64_t LOCRE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SCTRIM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SCFTRIM:1;
      uint64_t FCTRIM:4;
      uint64_t DRST_DRS:2;
      uint64_t DMX32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED_0:5;
      uint64_t CME:1;
      uint64_t RESERVED_1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IRCST:1;
      uint64_t OSCINIT0:1;
      uint64_t CLKST:2;
      uint64_t IREFST:1;
      uint64_t RESERVED:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) S;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LOCS0:1;
      uint64_t FCRDIV:3;
      uint64_t FLTPRSRV:1;
      uint64_t ATMF:1;
      uint64_t ATMS:1;
      uint64_t ATME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SC;

  uint8_t res1[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ATCVH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ATCVH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ATCVL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ATCVL;

};

#define MCG (*(volatile struct MCG_tag *) 0x40064000)

struct OSC0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SC16P:1;
      uint64_t SC8P:1;
      uint64_t SC4P:1;
      uint64_t SC2P:1;
      uint64_t RESERVED_0:1;
      uint64_t EREFSTEN:1;
      uint64_t RESERVED_1:1;
      uint64_t ERCLKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CR;

};

#define OSC0 (*(volatile struct OSC0_tag *) 0x40065000)

struct I2C0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t AD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ICR:6;
      uint64_t MULT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t WUEN:1;
      uint64_t RSTA:1;
      uint64_t TXAK:1;
      uint64_t TX:1;
      uint64_t MST:1;
      uint64_t IICIE:1;
      uint64_t IICEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXAK:1;
      uint64_t IICIF:1;
      uint64_t SRW:1;
      uint64_t RAM:1;
      uint64_t ARBL:1;
      uint64_t BUSY:1;
      uint64_t IAAS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) S;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AD:3;
      uint64_t RMEN:1;
      uint64_t SBRC:1;
      uint64_t HDRS:1;
      uint64_t ADEXT:1;
      uint64_t GCAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FLT:5;
      uint64_t STOPIE:1;
      uint64_t STOPF:1;
      uint64_t SHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FLT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t RAD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RA;

};

#define I2C0 (*(volatile struct I2C0_tag *) 0x40066000)

struct I2C1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t AD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) A1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ICR:6;
      uint64_t MULT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) F;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t WUEN:1;
      uint64_t RSTA:1;
      uint64_t TXAK:1;
      uint64_t TX:1;
      uint64_t MST:1;
      uint64_t IICIE:1;
      uint64_t IICEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXAK:1;
      uint64_t IICIF:1;
      uint64_t SRW:1;
      uint64_t RAM:1;
      uint64_t ARBL:1;
      uint64_t BUSY:1;
      uint64_t IAAS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) S;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AD:3;
      uint64_t RMEN:1;
      uint64_t SBRC:1;
      uint64_t HDRS:1;
      uint64_t ADEXT:1;
      uint64_t GCAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FLT:5;
      uint64_t STOPIE:1;
      uint64_t STOPF:1;
      uint64_t SHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FLT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t RAD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RA;

