iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis-KL02/targetInit/MKL02Z32_sfr.h
};

#define I2C1 (*(volatile struct I2C1_tag *) 0x40067000)

struct UART0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBR:5;
      uint64_t SBNS:1;
      uint64_t RXEDGIE:1;
      uint64_t LBKDIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BDH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BDL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PT:1;
      uint64_t PE:1;
      uint64_t ILT:1;
      uint64_t WAKE:1;
      uint64_t M:1;
      uint64_t RSRC:1;
      uint64_t DOZEEN:1;
      uint64_t LOOPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBK:1;
      uint64_t RWU:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t ILIE:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PF:1;
      uint64_t FE:1;
      uint64_t NF:1;
      uint64_t OR:1;
      uint64_t IDLE:1;
      uint64_t RDRF:1;
      uint64_t TC:1;
      uint64_t TDRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) S1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAF:1;
      uint64_t LBKDE:1;
      uint64_t BRK13:1;
      uint64_t RWUID:1;
      uint64_t RXINV:1;
      uint64_t MSBF:1;
      uint64_t RXEDGIF:1;
      uint64_t LBKDIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) S2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PEIE:1;
      uint64_t FEIE:1;
      uint64_t NEIE:1;
      uint64_t ORIE:1;
      uint64_t TXINV:1;
      uint64_t TXDIR:1;
      uint64_t R9T8:1;
      uint64_t R8T9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t R0T0:1;
      uint64_t R1T1:1;
      uint64_t R2T2:1;
      uint64_t R3T3:1;
      uint64_t R4T4:1;
      uint64_t R5T5:1;
      uint64_t R6T6:1;
      uint64_t R7T7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MA1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MA2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OSR:5;
      uint64_t M10:1;
      uint64_t MAEN2:1;
      uint64_t MAEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESYNCDIS:1;
      uint64_t BOTHEDGE:1;
      uint64_t RESERVED_0:3;
      uint64_t RDMAE:1;
      uint64_t RESERVED_1:1;
      uint64_t TDMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C5;

};

#define UART0 (*(volatile struct UART0_tag *) 0x4006a000)

struct CMP0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t HYSTCTR:2;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t FILTER_CNT:3;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CR0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t OPE:1;
      uint64_t COS:1;
      uint64_t INV:1;
      uint64_t PMODE:1;
      uint64_t TRIGM:1;
      uint64_t WE:1;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FILT_PER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FPR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COUT:1;
      uint64_t CFF:1;
      uint64_t CFR:1;
      uint64_t IEF:1;
      uint64_t IER:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VOSEL:6;
      uint64_t VRSEL:1;
      uint64_t DACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DACCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MSEL:3;
      uint64_t PSEL:3;
      uint64_t RESERVED:1;
      uint64_t PSTM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MUXCR;

};

#define CMP0 (*(volatile struct CMP0_tag *) 0x40073000)

struct SPI0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t LSBFE:1;
      uint64_t SSOE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t MSTR:1;
      uint64_t SPTIE:1;
      uint64_t SPE:1;
      uint64_t SPIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SPC0:1;
      uint64_t SPISWAI:1;
      uint64_t RESERVED_0:1;
      uint64_t BIDIROE:1;
      uint64_t MODFEN:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t SPMIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SPR:4;
      uint64_t SPPR:3;
      uint64_t RESERVED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:4;
      uint64_t MODF:1;
      uint64_t SPTEF:1;
      uint64_t SPMF:1;
      uint64_t SPRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) S;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t Bits:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) D;

  uint8_t res1[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t Bits:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) M;

};

#define SPI0 (*(volatile struct SPI0_tag *) 0x40076000)

struct PMC_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t LVDV:2;
      uint64_t RESERVED:2;
      uint64_t LVDRE:1;
      uint64_t LVDIE:1;
      uint64_t LVDACK:1;
      uint64_t LVDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LVDSC1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LVWV:2;
      uint64_t RESERVED:3;
      uint64_t LVWIE:1;
      uint64_t LVWACK:1;
      uint64_t LVWF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LVDSC2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BGBE:1;
      uint64_t RESERVED_0:1;
      uint64_t REGONS:1;
      uint64_t ACKISO:1;
      uint64_t BGEN:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) REGSC;

