iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis-KL02/targetInit/MKL02Z32_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t PRI_11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_SHPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t PRI_14:8;
      uint64_t PRI_15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_SHPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t SVCALLPENDED:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_SHCSR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HALTED:1;
      uint64_t BKPT:1;
      uint64_t DWTTRAP:1;
      uint64_t VCATCH:1;
      uint64_t EXTERNAL:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_DFSR;

};

#define SystemControl (*(volatile struct SystemControl_tag *) 0xe000e008)

struct SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t COUNTFLAG:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define SysTick (*(volatile struct SysTick_tag *) 0xe000e010)

struct NVIC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER;

  uint8_t res0[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER;

  uint8_t res1[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR;

  uint8_t res2[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR;

  uint8_t res3[380];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_0:8;
      uint64_t PRI_1:8;
      uint64_t PRI_2:8;
      uint64_t PRI_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_4:8;
      uint64_t PRI_5:8;
      uint64_t PRI_6:8;
      uint64_t PRI_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_8:8;
      uint64_t PRI_9:8;
      uint64_t PRI_10:8;
      uint64_t PRI_11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_12:8;
      uint64_t PRI_13:8;
      uint64_t PRI_14:8;
      uint64_t PRI_15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_16:8;
      uint64_t PRI_17:8;
      uint64_t PRI_18:8;
      uint64_t PRI_19:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_20:8;
      uint64_t PRI_21:8;
      uint64_t PRI_22:8;
      uint64_t PRI_23:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_24:8;
      uint64_t PRI_25:8;
      uint64_t PRI_26:8;
      uint64_t PRI_27:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_28:8;
      uint64_t PRI_29:8;
      uint64_t PRI_30:8;
      uint64_t PRI_31:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR7;

