iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis-KL02/targetInit/MKL02Z32_sfr.h
};

#define NVIC (*(volatile struct NVIC_tag *) 0xe000e100)

struct MTB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:2;
      uint64_t WRAP:1;
      uint64_t POINTER:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POSITION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:5;
      uint64_t TSTARTEN:1;
      uint64_t TSTOPEN:1;
      uint64_t SFRWPRIV:1;
      uint64_t RAMPRIV:1;
      uint64_t HALTREQ:1;
      uint64_t RESERVED:21;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTOSTOP:1;
      uint64_t AUTOHALT:1;
      uint64_t RESERVED:1;
      uint64_t WATERMARK:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASEADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE;

  uint8_t res0[3824];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODECTRL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODECTRL;

  uint8_t res1[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAGSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAGSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAGCLEAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAGCLEAR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKACCESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCKACCESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKSTAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCKSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIT0:1;
      uint64_t BIT1:1;
      uint64_t BIT2:1;
      uint64_t BIT3:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTHSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICEARCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVICEARCH;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICECFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVICECFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICETYPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVICETYPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID3;

};

#define MTB (*(volatile struct MTB_tag *) 0xf0000000)

struct MTBDWT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DWTCFGCTRL:28;
      uint64_t NUMCMP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNCTION:4;
      uint64_t RESERVED_0:4;
      uint64_t DATAVMATCH:1;
      uint64_t RESERVED_1:1;
      uint64_t DATAVSIZE:2;
      uint64_t DATAVADDR0:4;
      uint64_t RESERVED_2:4;
      uint64_t RESERVED_3:4;
      uint64_t MATCHED:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCT0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNCTION:4;
      uint64_t RESERVED_0:20;
      uint64_t MATCHED:1;
      uint64_t RESERVED_1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCT1;

  uint8_t res2[452];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACOMP0:1;
      uint64_t ACOMP1:1;
      uint64_t RESERVED:26;
      uint64_t NUMCOMP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBCTRL;

