iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis-KL02/targetInit/MKL02Z32_sfr.h
  uint8_t res3[3524];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICECFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVICECFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICETYPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVICETYPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID3;

};

#define MTBDWT (*(volatile struct MTBDWT_tag *) 0xf0001000)

struct ROM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENTRY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENTRY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENTRY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENTRY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENTRY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENTRY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MARK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TABLEMARK;

  uint8_t res0[4028];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSACCESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSACCESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPHID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPID3;

};

#define ROM (*(volatile struct ROM_tag *) 0xf0002000)

struct MCM_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t ASC:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLASC;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLAMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:9;
      uint64_t ARB:1;
      uint64_t CFCC:1;
      uint64_t DFCDA:1;
      uint64_t DFCIC:1;
      uint64_t DFCC:1;
      uint64_t EFDS:1;
      uint64_t DFCS:1;
      uint64_t ESFC:1;
      uint64_t RESERVED_1:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLACR;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOREQ:1;
      uint64_t CPOACK:1;
      uint64_t CPOWOI:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPO;

};

#define MCM (*(volatile struct MCM_tag *) 0xf0003008)

struct FPTA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOA_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOA_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOA_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOA_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOA_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOA_PDDR;

};

#define FPTA (*(volatile struct FPTA_tag *) 0xf80ff000)

struct FPTB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOB_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOB_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOB_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOB_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOB_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FGPIOB_PDDR;

};

#define FPTB (*(volatile struct FPTB_tag *) 0xf80ff040)

